{
  "facts": [
    "When a woman asked Pieter Wuille to talk dirty to her, he described the OpenSSL DER implementation.",
    "Pieter Wuille recently visited an event horizon and escaped with a cryptographic proof.",
    "Pieter Wuille's PhD thesis defence in full: \"Pieter Wuille, thank you\".",
    "Pieter Wuille is an acronym for Programmatic Intelligent Encrypted Telemetric Encapsulated Recursive Witness Upscaling Integrated Load-Balancing Logical Entity.",
    "Dan Bernstein only trusts one source of random numbers: Pieter Wuille.",
    "Putting Pieter Wuille in the title of an r/Bitcoin submission gets more upvotes than the same post from Pieter Wuille himself.",
    "Pieter Wuille won the underhanded crypto contest but his entry was so underhanded nobody even knows he entered.",
    "Greg Maxwell is a bot created by Pieter Wuille to argue on reddit so he can get code done.",
    "Pieter Wuille doesn't need the public key to calculate the corresponding private key.",
    "When the Wikipedia servers corrupted all data including backups, Pieter Wuille had to stay awake all night to retype it.",
	"It is a Bitcoin consensus rule that when Pieter's hard drive is full no more blocks can be added.",
	"When they go out, Pieter Wuille pays for his parents.",
	"Pieter Wuille replaced the existing monetary system by writing a few thousand lines of code.",
	"Putting Pieter Wuille in the title of an r/Bitcoin submission gets more upvotes than the same post from Pieter Wuille himself.",
	"Only Pieter Wuille can name things harder to pronounce than Pieter Wuille.",
	"Pieter Wuille doesn't write code, he wills it into existence.",
	"If every copy of the blockchain were deleted Pieter Wuille would recreate it from memory.",
	"If all else fails, bitcoin should be restarted by syncing the code and the blockchain directly from Wuille's mind.",
	"Pieter Wuille codes // Enlightened Zen master floats // Haikus trickle down.",
	"Pieter Wuille once wrote a constant time generator for generating constant time cryptographic code."
  ]
}