[
    {
      "category": "general",
      "medium": "bitcointalk",
      "text": "It would have been nice to get this attention in any other context.  WikiLeaks has kicked the hornet's nest, and the swarm is headed towards us.",
      "post_id": "542",
      "date": "December 11, 2010"
    },
    {
      "category": "bitcoin-economics",
      "medium": "bitcointalk",
      "text": "Bitcoins have no dividend or potential future dividend, therefore not like a stock.\n\nMore like a collectible or commodity.",
      "post_id": "427",
      "date": "August 27, 2010"
    },
    {
      "category": "difficulty",
      "medium": "bitcointalk",
      "text": "Difficulty just increased by 4 times, so now your cost is US$0.02/BTC.",
      "post_id": "223",
      "date": "July 16, 2010"
    },
    {
      "category": "nodes",
      "medium": "bitcointalk",
      "text": "At equilibrium size, many nodes will be server farms with one or two network nodes that feed the rest of the farm over a LAN.",
      "post_id": "188",
      "date": "July 14, 2010"
    },
    {
      "category": "general",
      "medium": "bitcointalk",
      "text": "Writing a description for this thing for general audiences is bloody hard.  There's nothing to relate it to.",
      "post_id": "167",
      "date": "July 5, 2010"
    },
    {
      "category": "bitcoin-economics",
      "medium": "bitcointalk",
      "text": "Lost coins only make everyone else's coins worth slightly more.  Think of it as a donation to everyone.",
      "post_id": "131",
      "date": "June 21, 2010"
    },
    {
      "category": "encryption",
      "medium": "bitcointalk",
      "text": "SHA-256 is very strong.  It's not like the incremental step from MD5 to SHA1.  It can last several decades unless there's some massive breakthrough attack.",
      "post_id": "119",
      "date": "June 14, 2010"
    },
    {
      "category": "releases",
      "medium": "bitcointalk",
      "text": "Does anyone want to translate the Bitcoin client itself?  It would be great to have at least one other language in the 0.3 release.",
      "post_id": "111",
      "date": "May 26, 2010"
    },
    {
      "category": "bitcoin-design",
      "medium": "bitcointalk",
      "text": "How does everyone feel about the B symbol with the two lines through the outside?  Can we live with that as our logo?",
      "post_id": "83",
      "date": "February 26, 2010"
    },
    {
      "category": "transactions",
      "medium": "bitcointalk",
      "text": "That would be nice at point-of-sale.  The cash register displays a QR-code encoding a bitcoin address and amount on a screen and you photo it with your mobile.",
      "post_id": "73",
      "date": "February 24, 2010"
    },
    {
      "category": "bitcoin-economics",
      "medium": "bitcointalk",
      "text": "At the moment, generation effort is rapidly increasing, suggesting people are estimating the present value to be higher than the current cost of production.",
      "post_id": "65",
      "date": "February 21, 2010"
    },
    {
      "category": "bitcoin-economics",
      "medium": "bitcointalk",
      "text": "I'm sure that in 20 years there will either be very large transaction volume or no volume.",
      "post_id": "57",
      "date": "February 14, 2010"
    },
    {
      "category": "bitcoin-economics, fees",
      "medium": "bitcointalk",
      "text": "In a few decades when the reward gets too small, the transaction fee will become the main compensation for nodes.",
      "post_id": "57",
      "date": "February 14, 2010"
    },
    {
      "category": "nodes, mining, fees",
      "medium": "bitcointalk",
      "text": "If you're sad about paying the fee, you could always turn the tables and run a node yourself and maybe someday rake in a 0.44 fee yourself.",
      "post_id": "56",
      "date": "February 14, 2010"
    },
    {
      "category": "privacy",
      "medium": "bitcointalk",
      "text": "Bitcoin is still very new and has not been independently analysed.  If you're serious about privacy, TOR is an advisable precaution.",
      "post_id": "45",
      "date": "February 6, 2010"
    },
    {
      "category": "privacy",
      "medium": "bitcointalk",
      "text": "You could use TOR if you don't want anyone to know you're even using Bitcoin.",
      "post_id": "45",
      "date": "February 6, 2010"
    },
    {
      "category": "privacy, transactions",
      "medium": "bitcointalk",
      "text": "For greater privacy, it's best to use bitcoin addresses only once.",
      "post_id": "11",
      "date": "November 25, 2009"
    },
    {
      "category": "bitcoin-economics",
      "medium": "p2pfoundation",
      "text": "You could say coins are issued by the majority. They are issued in a limited, predetermined amount.",
      "post_id": "3",
      "date": "February 18, 2009"
    },
    {
      "category": "cryptocurrency",
      "medium": "p2pfoundation",
      "text": "With e-currency based on cryptographic proof, without the need to trust a third party middleman, money can be secure and transactions effortless.",
      "post_id": "1",
      "date": "February 11, 2009"
    },
    {
      "category": "identity",
      "medium": "p2pfoundation",
      "text": "I am not Dorian Nakamoto.",
      "post_id": "4",
      "date": "March 7, 2014"
    },
    {
      "category": "bitcoin-design",
      "medium": "email",
      "email_id": "1",
      "text": "I've been working on a new electronic cash system that's fully peer-to-peer, with no trusted third party.",
      "date": "November 1, 2008"
    },
    {
      "category": "nodes",
      "medium": "email",
      "email_id": "2",
      "text": "Only people trying to create new coins would need to run network nodes.",
      "date": "November 2, 2008"
    },
    {
      "category": "mining",
      "medium": "email",
      "email_id": "3",
      "text": "The requirement is that the good guys collectively have more CPU proof-of-worker than any single attacker.",
      "date": "November 3, 2008"
    },
    {
      "category": "mining",
      "medium": "email",
      "email_id": "3",
      "text": "The Bitcoin network might actually reduce spam by diverting zombie farms to generating bitcoins instead.",
      "date": "November 3, 2008"
    },
    {
      "category": "motives",
      "medium": "email",
      "email_id": "4",
      "text": "Yes, but we can win a major battle in the arms race and gain a new territory of freedom for several years.",
      "date": "November 7, 2008"
    },
    {
      "category": "p2p-networks, government",
      "medium": "email",
      "email_id": "4",
      "text": "Governments are good at cutting off the heads of a centrally controlled networks like Napster, but pure P2P networks like Gnutella and Tor seem to be holding their own.",
      "date": "November 7, 2008"
    },
    {
      "category": "transactions",
      "medium": "email",
      "email_id": "7",
      "text": "It's not a problem if transactions have to wait one or a few extra cycles to get into a block.",
      "date": "November 9, 2008"
    },
    {
      "category": "proof-of-work",
      "medium": "email",
      "email_id": "8",
      "text": "The proof-of-work chain is the solution to the synchronisation problem, and to knowing what the globally shared view is without having to trust anyone.",
      "date": "November 9, 2008"
    },
    {
      "category": "double-spending",
      "medium": "email",
      "email_id": "10",
      "text": "When there are multiple double-spent versions of the same transaction, one and only one will become valid.",
      "date": "November 11, 2008"
    },
    {
      "category": "double-spending",
      "medium": "email",
      "email_id": "10",
      "text": "The receiver of a payment must wait an hour or so before believing that it's valid. The network will resolve any possible double-spend races by then.",
      "date": "November 11, 2008"
    },
    {
      "category": "nodes",
      "medium": "email",
      "email_id": "10",
      "text": "With the transaction fee based incentive system I recently posted, nodes would have an incentive to include all the paying transactions they receive.",
      "date": "November 11, 2008"
    },
    {
      "category": "motives",
      "medium": "email",
      "email_id": "12",
      "text": "It's very attractive to the libertarian viewpoint if we can explain it properly. I'm better with code than with words though.",
      "date": "November 13, 2008"
    },
    {
      "category": "releases",
      "medium": "email",
      "email_id": "13",
      "text": "I'll try and hurry up and release the sourcecode as soon as possible to serve as a reference to help clear up all these implementation questions.",
      "date": "November 17, 2008"
    },
    {
      "category": "proof-of-work",
      "medium": "email",
      "email_id": "14",
      "text": "The credential that establishes someone as real is the ability to supply CPU proof-of-worker.",
      "date": "November 17, 2008"
    },
    {
      "category": "nodes",
      "medium": "email",
      "email_id": "16",
      "text": "If you can keep a node running that accepts incoming connections, you'll really be helping the network a lot. Port 8333 on your firewall needs to be open to receive incoming connections.",
      "date": "January 9, 2009"
    },
    {
      "category": "micropayments",
      "medium": "email",
      "email_id": "17",
      "text": "Subscription sites that need some extra proof-of-work for their free trial so it doesn't cannibalize subscriptions could charge bitcoins for the trial.",
      "date": "January 17, 2009"
    },
    {
      "category": "cryptocurrency",
      "text": "A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.",
      "medium": "whitepaper",
      "date": "October 31, 2008"
    }
  ]